Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.SetPresenceOfSegments(System.Boolean,System.Boolean,System.Boolean)
Simultaneously set the presence of all 3D segments.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The shape is disconnected or forms a complete loop:
If the duplicate shape is present, exactly one of the connectors must be present.

Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.DepthParamId
Id of the parameter driving the multiplanar depth.
The depth is measured center-to-center of the bar.
A valid shape parameter must be assigned to DepthParamId before
the MultiplanarDefinition can be used in RebarShape creation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.OutOfPlaneBendDiameter
Bend diameter to be applied to the connector segments.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for outOfPlaneBendDiameter must be greater than 0 and no more than 30000 feet.

Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.IsEndConnectorPresent
Whether a perpendicular segment is constructed
from the end of the 2D shape.

Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.IsStartConnectorPresent
Whether a perpendicular segment is constructed
from the start of the 2D shape.

Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.IsDuplicateShapePresent
Whether the shape definition includes an offset
copy of the 2D shape.

Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.#ctor(System.Double)
Create a RebarShapeMultiplanarDefinition for use in creating a RebarShape.
outOfPlaneBendDiameter:
Bend diameter to be used when the rebar bends out of its main plane.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for outOfPlaneBendDiameter must be greater than 0 and no more than 30000 feet.

Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition
A specification for a simple 3D rebar shape.
Remarks:
Simple 3D rebar shapes are supported by adding segments to a regular 2D shape definition.
The added segments consist of three optional parts: a "duplicate shape" and two connectors.
A "duplicate shape" is a second copy of the 2D shape, offset in a perpendicular direction,
and connected at either the start or the end by a perpendicular connector segment. Also
supported is adding one or both connector segments, without the duplicate shape.
Fillets are applied to the connector segments with a diameter that is given by
the OutOfPlaneBendDiameter property. The length of the connectors is given by the
Rebar instance parameter "multiplanar depth." The MultiplanarDepth property of this
class is the default value of the parameter.